---
kind: other
id: Properties.T:Autodesk.Revit.DB.AddInId
source: html/07c75cdd-40fe-3ca6-2caf-b1eed4582558.htm
---
# AddInId Properties

Specifies whether the .NET object represents a valid Revit entity.